portfolio/case3/artillery/00_before_artillery_full_log.txt
lys@DESKTOP-A5GME2Q MINGW64 ~/Desktop/photoProject/portfolio/case3/artillery (master)
$ artillery run case3_get_posts.yml
Test run id: tp6ae_4e9bbqtj8q9pp5zz9pwcw9wte4hdh_hawr
Phase started: unnamed (index: 0, duration: 120s) 22:12:24(+0900)

--------------------------------------
Metrics for period to: 22:12:30(+0900) (width: 4.257s)
--------------------------------------

http.codes.200: ................................................................ 16
http.downloaded_bytes: ......................................................... 82112
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 20
http.response_time:
  min: ......................................................................... 1014
  max: ......................................................................... 1076
  mean: ........................................................................ 1034.7
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1043.3
  p99: ......................................................................... 1043.3
http.response_time.2xx:
  min: ......................................................................... 1014
  max: ......................................................................... 1076
  mean: ........................................................................ 1034.7
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1043.3
  p99: ......................................................................... 1043.3
http.responses: ................................................................ 16
vusers.completed: .............................................................. 16
vusers.created: ................................................................ 20
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1017
  max: ......................................................................... 1079.6
  mean: ........................................................................ 1046.8
  median: ...................................................................... 1043.3
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4


--------------------------------------
Metrics for period to: 22:12:40(+0900) (width: 9.193s)
--------------------------------------

http.codes.200: ................................................................ 40
http.downloaded_bytes: ......................................................... 205280
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 40
http.response_time:
  min: ......................................................................... 987
  max: ......................................................................... 1108
  mean: ........................................................................ 1031.8
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1107.9
http.response_time.2xx:
  min: ......................................................................... 987
  max: ......................................................................... 1108
  mean: ........................................................................ 1031.8
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1107.9
http.responses: ................................................................ 40
vusers.completed: .............................................................. 40
vusers.created: ................................................................ 40
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 40
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 990.1
  max: ......................................................................... 1121.2
  mean: ........................................................................ 1035.9
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1107.9


--------------------------------------
Metrics for period to: 22:12:50(+0900) (width: 9.181s)
--------------------------------------

http.codes.200: ................................................................ 36
http.downloaded_bytes: ......................................................... 184752
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 40
http.response_time:
  min: ......................................................................... 994
  max: ......................................................................... 2074
  mean: ........................................................................ 1350
  median: ...................................................................... 1200.1
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2059.5
http.response_time.2xx:
  min: ......................................................................... 994
  max: ......................................................................... 2074
  mean: ........................................................................ 1350
  median: ...................................................................... 1200.1
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2059.5
http.responses: ................................................................ 36
vusers.completed: .............................................................. 36
vusers.created: ................................................................ 40
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 40
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 997.1
  max: ......................................................................... 2076.6
  mean: ........................................................................ 1353.9
  median: ...................................................................... 1224.4
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2059.5


--------------------------------------
Metrics for period to: 22:13:00(+0900) (width: 9.882s)
--------------------------------------

http.codes.200: ................................................................ 43
http.downloaded_bytes: ......................................................... 220676
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 40
http.response_time:
  min: ......................................................................... 1164
  max: ......................................................................... 2528
  mean: ........................................................................ 1705.7
  median: ...................................................................... 1686.1
  p95: ......................................................................... 2276.1
  p99: ......................................................................... 2369
http.response_time.2xx:
  min: ......................................................................... 1164
  max: ......................................................................... 2528
  mean: ........................................................................ 1705.7
  median: ...................................................................... 1686.1
  p95: ......................................................................... 2276.1
  p99: ......................................................................... 2369
http.responses: ................................................................ 43
vusers.completed: .............................................................. 43
vusers.created: ................................................................ 40
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 40
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1167.9
  max: ......................................................................... 2531.5
  mean: ........................................................................ 1716.3
  median: ...................................................................... 1686.1
  p95: ......................................................................... 2276.1
  p99: ......................................................................... 2369


--------------------------------------
Metrics for period to: 22:13:10(+0900) (width: 9.731s)
--------------------------------------

http.codes.200: ................................................................ 41
http.downloaded_bytes: ......................................................... 210412
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 40
http.response_time:
  min: ......................................................................... 1031
  max: ......................................................................... 1385
  mean: ........................................................................ 1145.4
  median: ...................................................................... 1107.9
  p95: ......................................................................... 1300.1
  p99: ......................................................................... 1300.1
http.response_time.2xx:
  min: ......................................................................... 1031
  max: ......................................................................... 1385
  mean: ........................................................................ 1145.4
  median: ...................................................................... 1107.9
  p95: ......................................................................... 1300.1
  p99: ......................................................................... 1300.1
http.responses: ................................................................ 41
vusers.completed: .............................................................. 41
vusers.created: ................................................................ 40
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 40
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1033.5
  max: ......................................................................... 1387.1
  mean: ........................................................................ 1150.1
  median: ...................................................................... 1130.2
  p95: ......................................................................... 1300.1
  p99: ......................................................................... 1300.1


--------------------------------------
Metrics for period to: 22:13:20(+0900) (width: 9.476s)
--------------------------------------

http.codes.200: ................................................................ 30
http.downloaded_bytes: ......................................................... 153960
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 39
http.response_time:
  min: ......................................................................... 1034
  max: ......................................................................... 3987
  mean: ........................................................................ 2026.5
  median: ...................................................................... 1826.6
  p95: ......................................................................... 3752.7
  p99: ......................................................................... 3828.5
http.response_time.2xx:
  min: ......................................................................... 1034
  max: ......................................................................... 3987
  mean: ........................................................................ 2026.5
  median: ...................................................................... 1826.6
  p95: ......................................................................... 3752.7
  p99: ......................................................................... 3828.5
http.responses: ................................................................ 30
vusers.completed: .............................................................. 30
vusers.created: ................................................................ 39
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 39
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1037.1
  max: ......................................................................... 4051.4
  mean: ........................................................................ 2043.8
  median: ...................................................................... 1826.6
  p95: ......................................................................... 3828.5
  p99: ......................................................................... 3828.5


--------------------------------------
Metrics for period to: 22:13:30(+0900) (width: 9.936s)
--------------------------------------

http.codes.200: ................................................................ 48
http.downloaded_bytes: ......................................................... 246336
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 40
http.response_time:
  min: ......................................................................... 1034
  max: ......................................................................... 4827
  mean: ........................................................................ 2193
  median: ...................................................................... 1939.5
  p95: ......................................................................... 4231.1
  p99: ......................................................................... 4583.6
http.response_time.2xx:
  min: ......................................................................... 1034
  max: ......................................................................... 4827
  mean: ........................................................................ 2193
  median: ...................................................................... 1939.5
  p95: ......................................................................... 4231.1
  p99: ......................................................................... 4583.6
http.responses: ................................................................ 48
vusers.completed: .............................................................. 48
vusers.created: ................................................................ 40
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 40
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1036.3
  max: ......................................................................... 4947.8
  mean: ........................................................................ 2226.6
  median: ...................................................................... 1978.7
  p95: ......................................................................... 4231.1
  p99: ......................................................................... 4583.6


--------------------------------------
Metrics for period to: 22:13:40(+0900) (width: 9.916s)
--------------------------------------

http.codes.200: ................................................................ 42
http.downloaded_bytes: ......................................................... 215544
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 41
http.response_time:
  min: ......................................................................... 1021
  max: ......................................................................... 1519
  mean: ........................................................................ 1140.7
  median: ...................................................................... 1107.9
  p95: ......................................................................... 1326.4
  p99: ......................................................................... 1525.7
http.response_time.2xx:
  min: ......................................................................... 1021
  max: ......................................................................... 1519
  mean: ........................................................................ 1140.7
  median: ...................................................................... 1107.9
  p95: ......................................................................... 1326.4
  p99: ......................................................................... 1525.7
http.responses: ................................................................ 42
vusers.completed: .............................................................. 42
vusers.created: ................................................................ 41
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 41
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1024
  max: ......................................................................... 1521
  mean: ........................................................................ 1144.2
  median: ...................................................................... 1107.9
  p95: ......................................................................... 1353.1
  p99: ......................................................................... 1525.7


--------------------------------------
Metrics for period to: 22:13:50(+0900) (width: 9.353s)
--------------------------------------

http.codes.200: ................................................................ 40
http.downloaded_bytes: ......................................................... 205280
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 40
http.response_time:
  min: ......................................................................... 1011
  max: ......................................................................... 1362
  mean: ........................................................................ 1124.3
  median: ...................................................................... 1085.9
  p95: ......................................................................... 1326.4
  p99: ......................................................................... 1326.4
http.response_time.2xx:
  min: ......................................................................... 1011
  max: ......................................................................... 1362
  mean: ........................................................................ 1124.3
  median: ...................................................................... 1085.9
  p95: ......................................................................... 1326.4
  p99: ......................................................................... 1326.4
http.responses: ................................................................ 40
vusers.completed: .............................................................. 40
vusers.created: ................................................................ 40
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 40
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1013.6
  max: ......................................................................... 1364.9
  mean: ........................................................................ 1127.7
  median: ...................................................................... 1107.9
  p95: ......................................................................... 1326.4
  p99: ......................................................................... 1326.4


--------------------------------------
Metrics for period to: 22:14:00(+0900) (width: 9.259s)
--------------------------------------

http.codes.200: ................................................................ 40
http.downloaded_bytes: ......................................................... 205280
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 40
http.response_time:
  min: ......................................................................... 1054
  max: ......................................................................... 1336
  mean: ........................................................................ 1153.9
  median: ...................................................................... 1107.9
  p95: ......................................................................... 1274.3
  p99: ......................................................................... 1326.4
http.response_time.2xx:
  min: ......................................................................... 1054
  max: ......................................................................... 1336
  mean: ........................................................................ 1153.9
  median: ...................................................................... 1107.9
  p95: ......................................................................... 1274.3
  p99: ......................................................................... 1326.4
http.responses: ................................................................ 40
vusers.completed: .............................................................. 40
vusers.created: ................................................................ 40
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 40
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1057.1
  max: ......................................................................... 1346.3
  mean: ........................................................................ 1158.6
  median: ...................................................................... 1130.2
  p95: ......................................................................... 1274.3
  p99: ......................................................................... 1326.4


--------------------------------------
Metrics for period to: 22:14:10(+0900) (width: 9.461s)
--------------------------------------

http.codes.200: ................................................................ 40
http.downloaded_bytes: ......................................................... 205280
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 40
http.response_time:
  min: ......................................................................... 1068
  max: ......................................................................... 1484
  mean: ........................................................................ 1225.3
  median: ...................................................................... 1200.1
  p95: ......................................................................... 1436.8
  p99: ......................................................................... 1465.9
http.response_time.2xx:
  min: ......................................................................... 1068
  max: ......................................................................... 1484
  mean: ........................................................................ 1225.3
  median: ...................................................................... 1200.1
  p95: ......................................................................... 1436.8
  p99: ......................................................................... 1465.9
http.responses: ................................................................ 40
vusers.completed: .............................................................. 40
vusers.created: ................................................................ 40
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 40
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1070.4
  max: ......................................................................... 1485.9
  mean: ........................................................................ 1232.1
  median: ...................................................................... 1224.4
  p95: ......................................................................... 1436.8
  p99: ......................................................................... 1465.9


Phase completed: unnamed (index: 0, duration: 120s) 22:14:24(+0900)

--------------------------------------
Metrics for period to: 22:14:20(+0900) (width: 9.35s)
--------------------------------------

http.codes.200: ................................................................ 40
http.downloaded_bytes: ......................................................... 205280
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 40
http.response_time:
  min: ......................................................................... 1072
  max: ......................................................................... 1396
  mean: ........................................................................ 1196.5
  median: ...................................................................... 1200.1
  p95: ......................................................................... 1380.5
  p99: ......................................................................... 1380.5
http.response_time.2xx:
  min: ......................................................................... 1072
  max: ......................................................................... 1396
  mean: ........................................................................ 1196.5
  median: ...................................................................... 1200.1
  p95: ......................................................................... 1380.5
  p99: ......................................................................... 1380.5
http.responses: ................................................................ 40
vusers.completed: .............................................................. 40
vusers.created: ................................................................ 40
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 40
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1074.6
  max: ......................................................................... 1398.9
  mean: ........................................................................ 1204.4
  median: ...................................................................... 1200.1
  p95: ......................................................................... 1380.5
  p99: ......................................................................... 1380.5


--------------------------------------
Metrics for period to: 22:14:30(+0900) (width: 5.445s)
--------------------------------------

http.codes.200: ................................................................ 24
http.downloaded_bytes: ......................................................... 123168
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 20
http.response_time:
  min: ......................................................................... 1094
  max: ......................................................................... 1320
  mean: ........................................................................ 1210.6
  median: ...................................................................... 1200.1
  p95: ......................................................................... 1274.3
  p99: ......................................................................... 1300.1
http.response_time.2xx:
  min: ......................................................................... 1094
  max: ......................................................................... 1320
  mean: ........................................................................ 1210.6
  median: ...................................................................... 1200.1
  p95: ......................................................................... 1274.3
  p99: ......................................................................... 1300.1
http.responses: ................................................................ 24
vusers.completed: .............................................................. 24
vusers.created: ................................................................ 20
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1097.4
  max: ......................................................................... 1322.2
  mean: ........................................................................ 1215.3
  median: ...................................................................... 1200.1
  p95: ......................................................................... 1300.1
  p99: ......................................................................... 1300.1


All VUs finished. Total time: 2 minutes, 1 second

--------------------------------
Summary report @ 22:14:27(+0900)
--------------------------------

http.codes.200: ................................................................ 480
http.downloaded_bytes: ......................................................... 2463360
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 480
http.response_time:
  min: ......................................................................... 987
  max: ......................................................................... 4827
  mean: ........................................................................ 1370.3
  median: ...................................................................... 1176.4
  p95: ......................................................................... 2416.8
  p99: ......................................................................... 3984.7
http.response_time.2xx:
  min: ......................................................................... 987
  max: ......................................................................... 4827
  mean: ........................................................................ 1370.3
  median: ...................................................................... 1176.4
  p95: ......................................................................... 2416.8
  p99: ......................................................................... 3984.7
http.responses: ................................................................ 480
vusers.completed: .............................................................. 480
vusers.created: ................................................................ 480
vusers.created_by_name.Case3 - GET /api/posts paging: .......................... 480
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 990.1
  max: ......................................................................... 4947.8
  mean: ........................................................................ 1379.6
  median: ...................................................................... 1176.4
  p95: ......................................................................... 2416.8
  p99: ......................................................................... 4065.2